<template>
  <el-card>
    <h2>我的角色</h2>
    <el-divider></el-divider>
    <p>该页面用于展示账号登记过角色的基本信息，在本页面，您可以通过点击相关的按钮，来新建各种各样的子标签页，实现相关的功能。</p>

    <h4>#唱歌、偏爱按钮组</h4>
    <p>奶系角色信息展示卡片的BUFF数据是经过计算得出的，并非原始输入的数据；通过点击唱歌、偏爱按钮可以切换展示的数据是否经过唱歌和偏爱加成。</p>

    <h2>角色信息列表</h2>
    <el-divider></el-divider>
    <p>点击该按钮会新建一个子标签页，该标签页可以通过表格或条形图的形式展示输出系职业或奶系职业的数据，并提供了数据排序和筛选功能。</p>
    <p>当显示奶系职业数据时，您同样可以点击唱歌偏爱按钮组来对展示的数据进行切换。</p>
    <p>在表格页面，您可以点击每列上方的倒三角形来弹出筛选组件；点击正反三角形组则可以让表格根据该列数据来进行排序。</p>
    <p>在图表页面中，您可以选择以哪项数据进行倒序排列，以及开关显示的数据。</p>
    <p>注：角色列表有显示上限，最多显示从旧到新的100条角色数据。</p>

    <h2>添加角色</h2>
    <el-divider></el-divider>
    <p>点击该按钮会新建一个子标签页，用于填写新添加角色的相关信息。</p>
    <p>输出系职业填写的是在修炼场对绿色沙袋打出的伤害，有15秒和20秒两档，可以同时进行填写。</p>
    <p>
      <img src="@/assets/buffer/buffDefault.jpg" style="height: 160px;width: atuo;" alt="fit" />
      <img src="@/assets/buffer/buffBurst.jpg" style="height: 160px;width: atuo;" alt="fit" />
    </p>
    <p>
      奶系职业填写的是常驻BUFF和太阳加成的数值，奶妈填写的是未唱歌的数值，
      奶萝则是未唱歌和未偏爱的数值，在有关角色展示页面中会提供按钮切换显示唱歌和偏爱的数值。
    </p>
    <p>奶爸请填写叠满二觉后的常驻BUFF和太阳加成的数值。</p>
    <p>
      奶系职业测BUFF数值最好可以找朋友一起进修炼场，让他帮你看实际吃到的BUFF数值，
      实在没有的话可以进帝国竞技场或者魔界盟会等能吃到自己奶的地图去测。
    </p>
    <p>
      在新建角色后会将相应的数据插入到该角色的历史数据中，不需要手动操作。
    </p>

    <h2>修改角色</h2>
    <el-divider></el-divider>
    <p>在角色数据展示卡片中点击该按钮会新建一个子标签页，用于修改角色的相关信息。</p>
    <p>信息填写基本同上，在此不再赘述</p>
    <p>
      在修改角色后会将相应的数据插入到该角色的历史数据中，不需要手动操作。
    </p>

    <h2>删除角色</h2>
    <el-divider></el-divider>
    <p>警告：此操作会永久删除该角色和相应的历史数据且无法恢复！在删除角色前请思考再三。</p>

    <h2>角色历史数据</h2>
    <el-divider></el-divider>
    <p>在角色数据展示卡片中点击该按钮会新建一个子标签页，用于展示该角色的相关历史数据。</p>
    <p>在图表卡片中的右上方的工具栏，可以切换显示图表的类型，可以在柱状图，折线图和柱状折线混合图中进行切换。</p>
    <p>当显示设备的像素宽度大于一定范围时（如电脑端），点击工具栏中的页面全屏按钮可以将图表切换至页面全屏或半屏，否则将默认页面全屏。</p>
    <p>当展示奶妈的历史数据时，工具栏会显示切换唱歌的按钮，点击可以对数据进行切换，选择展示是否唱歌的数据图。</p>
    <p>当展示奶萝的历史数据时，工具栏会显示切换唱歌和偏爱的按钮，点击可以对数据进行切换，选择展示是否唱歌和偏爱的数据图。</p>
    <p>在历史数据表格里展示的是历来登记和修改的原始数据，可以对某项不需要的历史数据进行删除。</p>
    <p>删除历史数据不可逆，请谨慎操作。</p>

  </el-card>
</template>