<template>
  <el-card>
    <h2>团队展示</h2>
    <el-divider></el-divider>
    <p>该页面用于展示您所创建或加入的团队以及成员的信息。</p>
    <p>如果您是该团队的管理员，那么您还可以对团队进行相应的管理。</p>
    <p>在本页面，您可以通过图表查看所有加入该团队的角色类型分布，以及职业类型分布。</p>

    <h2>成员信息</h2>
    <el-divider></el-divider>
    <p>该页面用于查看团队内所有成员的角色信息，并根据成员来进行分类。</p>
    <p>您可以通过卡片滚动、表格或者图表的形式查看某成员的角色列表，并可以对显示的角色类型进行筛选。</p>
    <p>要查看某角色的历史数据时，只能在卡片滚动显示模式下点击卡片下方的查看历史数据按钮来打开相应角色的历史数据标签页。</p>
    <p>在表格显示模式下，可以对相应的数据进行筛选和排序。</p>
    <p>在图表显示模式下，可以选择相应的数据为依据来进行倒序排序。</p>
    <p>在表格和图表显示模式下，当显示的职业为奶系职业时，同样提供了偏爱和唱歌的切换按钮。</p>

    <h2>角色信息</h2>
    <el-divider></el-divider>
    <p>该页面用于查看团队内所有成员的角色信息，与上述页面不同的是，该页面是根据角色的职能来进行分类的。</p>
    <p>在输出分类一栏，会通过表格或图表的形式展示团队内所有输出类职业的相关数据。</p>
    <p>纯C与辅C一栏基本同上，在此不再赘述。</p>
    <p>奶系一栏除上述功能外，同样添加了偏爱和唱歌的切换按钮。</p>

    <h2>团队管理</h2>
    <el-divider></el-divider>
    <h4>#管理员</h4>
    <p>当您在该团队的角色为管理员时，您可以在此页面对您的团队成员进行管理，以及修改团队的相关信息。</p>
    <p>在成员管理一栏，您可以对某位成员选择转让您的管理员权限或将其移出团队。</p>
    <b>注意：当您转让您的管理员权限时，您将会立即失去您的管理员身份，请谨慎操作。</b>
    <p>被移出的成员能再次加入到您的团队中，除非您修改了团队加入密码或者关闭了加入团队功能。</p>
    <p>在团队信息修改一栏，您可以修改团队的基本信息，如团队名称和是否允许加入；团队ID是固定的，不可修改。</p>
    <b>注意：在团队信息修改一栏，您还可以删除该团队，删除团队后，所有的团队成员将自动退出该团队，所有团队数据将清空，请谨慎操作。</b>
    <p>在团队申请密码修改一栏，您可以修改团队的加入密码。</p>
    <h4>#普通成员</h4>
    <p>当您在该团队的角色仅为普通成员时，您仅能在此页面选择退出团队。</p>
    
  </el-card>
</template>
